def crypt():
	print('введите текст для зашифровки (на керилеце)')
	text ='за арду'

	key = {
		'а':'-', 'б':'"', 'в':'|', 'г':'w',
		'д':'*', 'е':'!', 'ё':'[', 'ж':'v',
		'з':'/', 'и':'@', 'ё':']', 'к':'j',
		'л':'+', 'м':'#', 'н':'{', 'о':'s',
		'п':',', 'р':'$', 'с':'}', 'т':'g',
		'у':'.', 'ф':'^', 'х':'z', 'ц':'f',
		'ч':';', 'ш':'&', 'щ':'h', 'ъ':'>',
		'ы':':', 'ь':'?', 'ю':'l', 'я':'<',
		' ':'~', '.':'t', ',':'q', ':':'r',
		'й':'i'
	}

	crypt=""

	for i in text:
		if i in key:
			crypt += key[i]

	print( "Crypted text:\n" + crypt + "\n" )

def decript():
	print('введите текст для разшифровки (на керилеце)')
	texts = '/-~-$*.'

	keys = {
		'-':'а', '"':'б', '|':'в', 'w':'г',
		'*':'д', '!':'е', '[':'ё', 'v':'ж',
		'/':'з', '@':'и', ']':'ё', 'j':'к',
		'+':'л', '#':'м', '{':'н', 's':'о',
		',':'п', '$':'р', '}':'с', 'g':'т',
		'.':'у', '^':'ф', 'z':'х', 'f':'ц',
		';':'ч', '&':'ш', 'h':'щ', '>':'ъ',
		':':'ы', '?':'ь', 'l':'ю', '<':'я',
		'~':' ', 't':'.', 'q':',', 'r':':',
		'i':'й'
	}

	crypt=""

	for i in texts:
		if i in keys:
			crypt += keys[i]

	print( "Decrypted text:\n" + crypt + "\n" )

print('зашифровать сообщение(0) или разшифровать(1)')

a = input()


if a == '0':
	crypt()
elif a == '1':
	decript()
else:
	print('неверный ввод')
